xuzihang111/STM8-Voltmeter/STM8L电压表v1.2 无DMA/IOSTM8L051F3.h
#define MASK_DMA1_C3NDTR_NDT0    0x01
#define MASK_DMA1_C3NDTR_NDT1    0x02
#define MASK_DMA1_C3NDTR_NDT2    0x04
#define MASK_DMA1_C3NDTR_NDT3    0x08
#define MASK_DMA1_C3NDTR_NDT4    0x10
#define MASK_DMA1_C3NDTR_NDT5    0x20
#define MASK_DMA1_C3NDTR_NDT6    0x40
#define MASK_DMA1_C3NDTR_NDT7    0x80

#define MASK_DMA1_C3PARH_C3M1ARH_MEM_CLR_PA8 0x01
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_CLR_PA9 0x02
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_CLR_PA10 0x04
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_CLR_PA11 0x08
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_CLR_PA12 0x10
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_CLR_PA13 0x20
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_CLR_PA14 0x40
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_CLR_PA15 0x80
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_SET_M1A8 0x01
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_SET_M1A9 0x02
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_SET_M1A10 0x04
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_SET_M1A11 0x08
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_SET_M1A12 0x10
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_SET_M1A13 0x20
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_SET_M1A14 0x40
#define MASK_DMA1_C3PARH_C3M1ARH_MEM_SET_M1A15 0x80

/* Bit mask aliases for DMA1_C3PARH_C3M1ARH.mem_clr */
#define MASK_DMA1_C3PARH_PA8     0x01
#define MASK_DMA1_C3PARH_PA9     0x02
#define MASK_DMA1_C3PARH_PA10    0x04
#define MASK_DMA1_C3PARH_PA11    0x08
#define MASK_DMA1_C3PARH_PA12    0x10
#define MASK_DMA1_C3PARH_PA13    0x20
#define MASK_DMA1_C3PARH_PA14    0x40
#define MASK_DMA1_C3PARH_PA15    0x80


/* Bit mask aliases for DMA1_C3PARH_C3M1ARH.mem_set */
#define MASK_DMA1_C3M1ARH_M1A8   0x01
#define MASK_DMA1_C3M1ARH_M1A9   0x02
#define MASK_DMA1_C3M1ARH_M1A10  0x04
#define MASK_DMA1_C3M1ARH_M1A11  0x08
#define MASK_DMA1_C3M1ARH_M1A12  0x10
#define MASK_DMA1_C3M1ARH_M1A13  0x20
#define MASK_DMA1_C3M1ARH_M1A14  0x40
#define MASK_DMA1_C3M1ARH_M1A15  0x80


#define MASK_DMA1_C3PARL_C3M1ARL_MEM_CLR_PA0 0x01
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_CLR_PA1 0x02
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_CLR_PA2 0x04
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_CLR_PA3 0x08
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_CLR_PA4 0x10
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_CLR_PA5 0x20
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_CLR_PA6 0x40
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_CLR_PA7 0x80
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_SET_M1A0 0x01
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_SET_M1A1 0x02
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_SET_M1A2 0x04
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_SET_M1A3 0x08
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_SET_M1A4 0x10
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_SET_M1A5 0x20
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_SET_M1A6 0x40
#define MASK_DMA1_C3PARL_C3M1ARL_MEM_SET_M1A7 0x80

/* Bit mask aliases for DMA1_C3PARL_C3M1ARL.mem_clr */
#define MASK_DMA1_C3PARL_PA0     0x01
#define MASK_DMA1_C3PARL_PA1     0x02
#define MASK_DMA1_C3PARL_PA2     0x04
#define MASK_DMA1_C3PARL_PA3     0x08
#define MASK_DMA1_C3PARL_PA4     0x10
#define MASK_DMA1_C3PARL_PA5     0x20
#define MASK_DMA1_C3PARL_PA6     0x40
#define MASK_DMA1_C3PARL_PA7     0x80


/* Bit mask aliases for DMA1_C3PARL_C3M1ARL.mem_set */
#define MASK_DMA1_C3M1ARL_M1A0   0x01
#define MASK_DMA1_C3M1ARL_M1A1   0x02
#define MASK_DMA1_C3M1ARL_M1A2   0x04
#define MASK_DMA1_C3M1ARL_M1A3   0x08
#define MASK_DMA1_C3M1ARL_M1A4   0x10
#define MASK_DMA1_C3M1ARL_M1A5   0x20
#define MASK_DMA1_C3M1ARL_M1A6   0x40
#define MASK_DMA1_C3M1ARL_M1A7   0x80


#define MASK_DMA1_C3M0ARH_M0A8   0x01
#define MASK_DMA1_C3M0ARH_M0A9   0x02
#define MASK_DMA1_C3M0ARH_M0A10  0x04
#define MASK_DMA1_C3M0ARH_M0A11  0x08
#define MASK_DMA1_C3M0ARH_M0A12  0x10
#define MASK_DMA1_C3M0ARH_M0A13  0x20
#define MASK_DMA1_C3M0ARH_M0A14  0x40
#define MASK_DMA1_C3M0ARH_M0A15  0x80

#define MASK_DMA1_C3M0ARL_M0A0   0x01
#define MASK_DMA1_C3M0ARL_M0A1   0x02
#define MASK_DMA1_C3M0ARL_M0A2   0x04
#define MASK_DMA1_C3M0ARL_M0A3   0x08
#define MASK_DMA1_C3M0ARL_M0A4   0x10
#define MASK_DMA1_C3M0ARL_M0A5   0x20
#define MASK_DMA1_C3M0ARL_M0A6   0x40
#define MASK_DMA1_C3M0ARL_M0A7   0x80


/*-------------------------------------------------------------------------
 *      REMAP register definitions
 *-----------------------------------------------------------------------*/
/* Remapping register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADC1DMA_REMAP: 2;
  unsigned char TIM4DMA_REMAP: 2;
  unsigned char USART1TR_REMAP: 2;
  unsigned char USART1CK_REMAP: 1;
  unsigned char SPI1_REMAP  : 1;
} __BITS_SYSCFG_RMPCR1;
#endif
__IO_REG8_BIT(SYSCFG_RMPCR1, 0x509E, __READ_WRITE, __BITS_SYSCFG_RMPCR1);

/* Remapping register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADC1TRIG_REMAP: 1;
  unsigned char TIM2TRIG_REMAP: 1;
  unsigned char TIM3TRIG_REMAP: 1;
  unsigned char TIM2TRIGLSE_REMAP: 1;
  unsigned char TIM3TRIGLSE_REMAP: 1;
  unsigned char SPI2_REMAP  : 1;
  unsigned char TIM3TRIG_REMAP2: 1;
  unsigned char TIM23BKIN_REMAP: 1;
} __BITS_SYSCFG_RMPCR2;
#endif
__IO_REG8_BIT(SYSCFG_RMPCR2, 0x509F, __READ_WRITE, __BITS_SYSCFG_RMPCR2);

/* Remapping register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SPI1_REMAP  : 1;
  unsigned char USART3TR_REMAP: 1;
  unsigned char USART3CK_REMAP: 1;
  unsigned char TIM3_CH1_REMAP: 1;
  unsigned char TIM3_CH2_REMAP: 1;
  unsigned char CCO_REMAP   : 1;
  unsigned char TIM2_CH1_REMAP: 1;
  unsigned char TIM2_CH2_REMAP: 1;
} __BITS_SYSCFG_RMPCR3;
#endif
__IO_REG8_BIT(SYSCFG_RMPCR3, 0x509D, __READ_WRITE, __BITS_SYSCFG_RMPCR3);


/*-------------------------------------------------------------------------
 *      REMAP bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define SYSCFG_RMPCR1_ADC1DMA_REMAP SYSCFG_RMPCR1_bit.ADC1DMA_REMAP
#define SYSCFG_RMPCR1_TIM4DMA_REMAP SYSCFG_RMPCR1_bit.TIM4DMA_REMAP
#define SYSCFG_RMPCR1_USART1TR_REMAP SYSCFG_RMPCR1_bit.USART1TR_REMAP
#define SYSCFG_RMPCR1_USART1CK_REMAP SYSCFG_RMPCR1_bit.USART1CK_REMAP
#define SYSCFG_RMPCR1_SPI1_REMAP SYSCFG_RMPCR1_bit.SPI1_REMAP

#define SYSCFG_RMPCR2_ADC1TRIG_REMAP SYSCFG_RMPCR2_bit.ADC1TRIG_REMAP
#define SYSCFG_RMPCR2_TIM2TRIG_REMAP SYSCFG_RMPCR2_bit.TIM2TRIG_REMAP
#define SYSCFG_RMPCR2_TIM3TRIG_REMAP SYSCFG_RMPCR2_bit.TIM3TRIG_REMAP
#define SYSCFG_RMPCR2_TIM2TRIGLSE_REMAP SYSCFG_RMPCR2_bit.TIM2TRIGLSE_REMAP
#define SYSCFG_RMPCR2_TIM3TRIGLSE_REMAP SYSCFG_RMPCR2_bit.TIM3TRIGLSE_REMAP
#define SYSCFG_RMPCR2_SPI2_REMAP SYSCFG_RMPCR2_bit.SPI2_REMAP
#define SYSCFG_RMPCR2_TIM3TRIG_REMAP2 SYSCFG_RMPCR2_bit.TIM3TRIG_REMAP2
#define SYSCFG_RMPCR2_TIM23BKIN_REMAP SYSCFG_RMPCR2_bit.TIM23BKIN_REMAP

