xuzihang111/STM8-Voltmeter/STM8L电压表v1.2 无DMA/IOSTM8L051F3.h
#define PWR_CSR1_PVDE            PWR_CSR1_bit.PVDE
#define PWR_CSR1_PLS             PWR_CSR1_bit.PLS
#define PWR_CSR1_PVDIEN          PWR_CSR1_bit.PVDIEN
#define PWR_CSR1_PVDIF           PWR_CSR1_bit.PVDIF
#define PWR_CSR1_PVDOF           PWR_CSR1_bit.PVDOF

#define PWR_CSR2_VREFINTF        PWR_CSR2_bit.VREFINTF
#define PWR_CSR2_ULP             PWR_CSR2_bit.ULP
#define PWR_CSR2_FWU             PWR_CSR2_bit.FWU

#endif

/*-------------------------------------------------------------------------
 *      PWR bit masks
 *-----------------------------------------------------------------------*/
#define MASK_PWR_CSR1_PVDE       0x01
#define MASK_PWR_CSR1_PLS        0x0E
#define MASK_PWR_CSR1_PVDIEN     0x10
#define MASK_PWR_CSR1_PVDIF      0x20
#define MASK_PWR_CSR1_PVDOF      0x40

#define MASK_PWR_CSR2_VREFINTF   0x01
#define MASK_PWR_CSR2_ULP        0x02
#define MASK_PWR_CSR2_FWU        0x04


/*-------------------------------------------------------------------------
 *      CLK register definitions
 *-----------------------------------------------------------------------*/
/* Clock master divider register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CKM         : 3;
} __BITS_CLK_CKDIVR;
#endif
__IO_REG8_BIT(CLK_CKDIVR,  0x50C0, __READ_WRITE, __BITS_CLK_CKDIVR);

/* Clock RTC register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RTCSWBSY    : 1;
  unsigned char RTCSEL0     : 1;
  unsigned char RTCSEL1     : 1;
  unsigned char RTCSEL2     : 1;
  unsigned char RTCSEL3     : 1;
  unsigned char RTCDIV0     : 1;
  unsigned char RTCDIV1     : 1;
  unsigned char RTCDIV2     : 1;
} __BITS_CLK_CRTCR;
#endif
__IO_REG8_BIT(CLK_CRTCR,   0x50C1, __READ_WRITE, __BITS_CLK_CRTCR);

/* Internal clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char HSION       : 1;
  unsigned char HSIRDY      : 1;
  unsigned char LSION       : 1;
  unsigned char LSIRDY      : 1;
  unsigned char SAHALT      : 1;
  unsigned char FHWU        : 1;
  unsigned char BEEPAHALT   : 1;
} __BITS_CLK_ICKCR;
#endif
__IO_REG8_BIT(CLK_ICKCR,   0x50C2, __READ_WRITE, __BITS_CLK_ICKCR);

/* Peripheral clock gating register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PCKEN10     : 1;
  unsigned char PCKEN11     : 1;
  unsigned char PCKEN12     : 1;
  unsigned char PCKEN13     : 1;
  unsigned char PCKEN14     : 1;
  unsigned char PCKEN15     : 1;
  unsigned char PCKEN16     : 1;
  unsigned char PCKEN17     : 1;
} __BITS_CLK_PCKENR1;
#endif
__IO_REG8_BIT(CLK_PCKENR1, 0x50C3, __READ_WRITE, __BITS_CLK_PCKENR1);

/* Peripheral clock gating register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PCKEN20     : 1;
  unsigned char PCKEN21     : 1;
  unsigned char PCKEN22     : 1;
  unsigned char PCKEN23     : 1;
  unsigned char PCKEN24     : 1;
  unsigned char PCKEN25     : 1;
  unsigned char             : 1;
  unsigned char PCKEN27     : 1;
} __BITS_CLK_PCKENR2;
#endif
__IO_REG8_BIT(CLK_PCKENR2, 0x50C4, __READ_WRITE, __BITS_CLK_PCKENR2);

/* Peripheral clock gating register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PCKEN30     : 1;
  unsigned char PCKEN31     : 1;
  unsigned char PCKEN32     : 1;
  unsigned char PCKEN33     : 1;
  unsigned char PCKEN34     : 1;
  unsigned char PCKEN35     : 1;
} __BITS_CLK_PCKENR3;
#endif
__IO_REG8_BIT(CLK_PCKENR3, 0x50D0, __READ_WRITE, __BITS_CLK_PCKENR3);

/* Configurable clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCOSWBSY    : 1;
  unsigned char CCOSEL      : 4;
  unsigned char CCODIV      : 3;
} __BITS_CLK_CCOR;
#endif
__IO_REG8_BIT(CLK_CCOR,    0x50C5, __READ_WRITE, __BITS_CLK_CCOR);

/* External clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char HSEON       : 1;
  unsigned char HSERDY      : 1;
  unsigned char LSEON       : 1;
  unsigned char LSERDY      : 1;
  unsigned char HSEBYP      : 1;
  unsigned char LSEBYP      : 1;
} __BITS_CLK_ECKR;
#endif
__IO_REG8_BIT(CLK_ECKR,    0x50C6, __READ_WRITE, __BITS_CLK_ECKR);

/* Clock master status register */
__IO_REG8    (CLK_SCSR,    0x50C7, __READ_WRITE);
/* Clock master switch register */
__IO_REG8    (CLK_SWR,     0x50C8, __READ_WRITE);
/* Clock switch control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SWBSY       : 1;
  unsigned char SWEN        : 1;
  unsigned char SWIEN       : 1;
  unsigned char SWIF        : 1;
} __BITS_CLK_SWCR;
#endif
__IO_REG8_BIT(CLK_SWCR,    0x50C9, __READ_WRITE, __BITS_CLK_SWCR);

/* Clock security system register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CSSEN       : 1;
  unsigned char AUX         : 1;
  unsigned char CSSDIE      : 1;
  unsigned char CSSD        : 1;
  unsigned char CSSDGON     : 1;
} __BITS_CLK_CSSR;
#endif
__IO_REG8_BIT(CLK_CSSR,    0x50CA, __READ_WRITE, __BITS_CLK_CSSR);

/* Clock BEEP register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char BEEPSWBSY   : 1;
  unsigned char CLKBEEPSEL0 : 1;
  unsigned char CLKBEEPSEL1 : 1;
} __BITS_CLK_CBEEPR;
#endif
__IO_REG8_BIT(CLK_CBEEPR,  0x50CB, __READ_WRITE, __BITS_CLK_CBEEPR);

/* HSI calibration register */
__IO_REG8    (CLK_HSICALR, 0x50CC, __READ);
/* HSI clock calibration trimming register */
__IO_REG8    (CLK_HSITRIMR, 0x50CD, __READ_WRITE);
/* HSI unlock register */
__IO_REG8    (CLK_HSIUNLCKR, 0x50CE, __READ_WRITE);
/* Main regulator control status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char REGREADY    : 1;
  unsigned char REGOFF      : 1;
  unsigned char HSIPD       : 1;
  unsigned char LSIPD       : 1;
  unsigned char HSEPD       : 1;
  unsigned char LSEPD       : 1;
  unsigned char EEBUSY      : 1;
  unsigned char EEREADY     : 1;
} __BITS_CLK_REGCSR;
#endif
__IO_REG8_BIT(CLK_REGCSR,  0x50CF, __READ_WRITE, __BITS_CLK_REGCSR);

/* CSS on LSE control and status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CSSEN       : 1;
  unsigned char SWITCHEN    : 1;
  unsigned char CSSIE       : 1;
  unsigned char CSSF        : 1;
  unsigned char SWITCHF     : 1;
} __BITS_CSSLSE_CSR;
#endif
__IO_REG8_BIT(CSSLSE_CSR,  0x5190, __READ_WRITE, __BITS_CSSLSE_CSR);


/*-------------------------------------------------------------------------
 *      CLK bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

