xuzihang111/STM8-Voltmeter/STM8L电压表v1.2 无DMA/IOSTM8L051F3.h
/* Alarm A subsecond register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALSS8       : 1;
  unsigned char ALSS9       : 1;
  unsigned char ALSS10      : 1;
  unsigned char ALSS11      : 1;
  unsigned char ALSS12      : 1;
  unsigned char ALSS13      : 1;
  unsigned char ALSS14      : 1;
} __BITS_RTC_ALRMASSRH;
#endif
__IO_REG8_BIT(RTC_ALRMASSRH, 0x5164, __READ_WRITE, __BITS_RTC_ALRMASSRH);

/* Alarm A subsecond register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALSS0       : 1;
  unsigned char ALSS1       : 1;
  unsigned char ALSS2       : 1;
  unsigned char ALSS3       : 1;
  unsigned char ALSS4       : 1;
  unsigned char ALSS5       : 1;
  unsigned char ALSS6       : 1;
  unsigned char ALSS7       : 1;
} __BITS_RTC_ALRMASSRL;
#endif
__IO_REG8_BIT(RTC_ALRMASSRL, 0x5165, __READ_WRITE, __BITS_RTC_ALRMASSRL);

/* Alarm A masking register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char MASKSS      : 4;
} __BITS_RTC_ALRMASSMSKR;
#endif
__IO_REG8_BIT(RTC_ALRMASSMSKR, 0x5166, __READ_WRITE, __BITS_RTC_ALRMASSMSKR);

/* Calibration register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CALM8       : 1;
  unsigned char             : 4;
  unsigned char CALW16      : 1;
  unsigned char CALW8       : 1;
  unsigned char CALP        : 1;
} __BITS_RTC_CALRH;
#endif
__IO_REG8_BIT(RTC_CALRH,   0x516A, __READ_WRITE, __BITS_RTC_CALRH);

/* Calibration register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CALM0       : 1;
  unsigned char CALM1       : 1;
  unsigned char CALM2       : 1;
  unsigned char CALM3       : 1;
  unsigned char CALM4       : 1;
  unsigned char CALM5       : 1;
  unsigned char CALM6       : 1;
  unsigned char CALM7       : 1;
} __BITS_RTC_CALRL;
#endif
__IO_REG8_BIT(RTC_CALRL,   0x516B, __READ_WRITE, __BITS_RTC_CALRL);

/* Tamper control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TAMPIE      : 1;
  unsigned char TAMP1E      : 1;
  unsigned char TAMP1TRG    : 1;
  unsigned char TAMP2E      : 1;
  unsigned char TAMP2TRG    : 1;
  unsigned char TAMP3E      : 1;
  unsigned char TAMP3TRG    : 1;
} __BITS_RTC_TCR1;
#endif
__IO_REG8_BIT(RTC_TCR1,    0x516C, __READ_WRITE, __BITS_RTC_TCR1);

/* Tamper control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TAMPFREQ    : 3;
  unsigned char TAMPFLT     : 2;
  unsigned char TAMPPRCH    : 2;
  unsigned char TAMPPUDIS   : 1;
} __BITS_RTC_TCR2;
#endif
__IO_REG8_BIT(RTC_TCR2,    0x516D, __READ_WRITE, __BITS_RTC_TCR2);


/*-------------------------------------------------------------------------
 *      RTC bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define RTC_TR1_SU               RTC_TR1_bit.SU
#define RTC_TR1_ST               RTC_TR1_bit.ST

#define RTC_TR2_MNU              RTC_TR2_bit.MNU
#define RTC_TR2_MNT              RTC_TR2_bit.MNT

#define RTC_TR3_HU               RTC_TR3_bit.HU
#define RTC_TR3_HT               RTC_TR3_bit.HT
#define RTC_TR3_PM               RTC_TR3_bit.PM

#define RTC_DR1_DU               RTC_DR1_bit.DU
#define RTC_DR1_DT               RTC_DR1_bit.DT

#define RTC_DR2_MU               RTC_DR2_bit.MU
#define RTC_DR2_MT               RTC_DR2_bit.MT
#define RTC_DR2_WDU              RTC_DR2_bit.WDU

#define RTC_DR3_YU               RTC_DR3_bit.YU
#define RTC_DR3_YT               RTC_DR3_bit.YT

#define RTC_CR1_WUCKSEL          RTC_CR1_bit.WUCKSEL
#define RTC_CR1_RATIO            RTC_CR1_bit.RATIO
#define RTC_CR1_FMT              RTC_CR1_bit.FMT

#define RTC_CR2_ALRAE            RTC_CR2_bit.ALRAE
#define RTC_CR2_WUTE             RTC_CR2_bit.WUTE
#define RTC_CR2_ALRAIE           RTC_CR2_bit.ALRAIE
#define RTC_CR2_WUTIE            RTC_CR2_bit.WUTIE

#define RTC_CR3_ADD1H            RTC_CR3_bit.ADD1H
#define RTC_CR3_SUB1H            RTC_CR3_bit.SUB1H
#define RTC_CR3_BCK              RTC_CR3_bit.BCK
#define RTC_CR3_POL              RTC_CR3_bit.POL
#define RTC_CR3_OSEL             RTC_CR3_bit.OSEL
#define RTC_CR3_COE              RTC_CR3_bit.COE

#define RTC_ISR1_ALRAWF          RTC_ISR1_bit.ALRAWF
#define RTC_ISR1_RECALPF         RTC_ISR1_bit.RECALPF
#define RTC_ISR1_WUTWF           RTC_ISR1_bit.WUTWF
#define RTC_ISR1_SHPF            RTC_ISR1_bit.SHPF
#define RTC_ISR1_INITS           RTC_ISR1_bit.INITS
#define RTC_ISR1_RSF             RTC_ISR1_bit.RSF
#define RTC_ISR1_INITF           RTC_ISR1_bit.INITF
#define RTC_ISR1_INIT            RTC_ISR1_bit.INIT

#define RTC_ISR2_ALRAF           RTC_ISR2_bit.ALRAF
#define RTC_ISR2_WUTF            RTC_ISR2_bit.WUTF
#define RTC_ISR2_TAMP1F          RTC_ISR2_bit.TAMP1F
#define RTC_ISR2_TAMP2F          RTC_ISR2_bit.TAMP2F
#define RTC_ISR2_TAMP3F          RTC_ISR2_bit.TAMP3F

#define RTC_SPRERH_PREDIV_S8     RTC_SPRERH_bit.PREDIV_S8
#define RTC_SPRERH_PREDIV_S9     RTC_SPRERH_bit.PREDIV_S9
#define RTC_SPRERH_PREDIV_S10    RTC_SPRERH_bit.PREDIV_S10
#define RTC_SPRERH_PREDIV_S11    RTC_SPRERH_bit.PREDIV_S11
#define RTC_SPRERH_PREDIV_S12    RTC_SPRERH_bit.PREDIV_S12

#define RTC_SPRERL_PREDIV_S0     RTC_SPRERL_bit.PREDIV_S0
#define RTC_SPRERL_PREDIV_S1     RTC_SPRERL_bit.PREDIV_S1
#define RTC_SPRERL_PREDIV_S2     RTC_SPRERL_bit.PREDIV_S2
#define RTC_SPRERL_PREDIV_S3     RTC_SPRERL_bit.PREDIV_S3
#define RTC_SPRERL_PREDIV_S4     RTC_SPRERL_bit.PREDIV_S4
#define RTC_SPRERL_PREDIV_S5     RTC_SPRERL_bit.PREDIV_S5
#define RTC_SPRERL_PREDIV_S6     RTC_SPRERL_bit.PREDIV_S6
#define RTC_SPRERL_PREDIV_S7     RTC_SPRERL_bit.PREDIV_S7

#define RTC_APRER_PREDIV_A       RTC_APRER_bit.PREDIV_A

#define RTC_WUTRH_WUT8           RTC_WUTRH_bit.WUT8
#define RTC_WUTRH_WUT9           RTC_WUTRH_bit.WUT9
#define RTC_WUTRH_WUT10          RTC_WUTRH_bit.WUT10
#define RTC_WUTRH_WUT11          RTC_WUTRH_bit.WUT11
#define RTC_WUTRH_WUT12          RTC_WUTRH_bit.WUT12
#define RTC_WUTRH_WUT13          RTC_WUTRH_bit.WUT13
#define RTC_WUTRH_WUT14          RTC_WUTRH_bit.WUT14
#define RTC_WUTRH_WUT15          RTC_WUTRH_bit.WUT15

#define RTC_WUTRL_WUT0           RTC_WUTRL_bit.WUT0
#define RTC_WUTRL_WUT1           RTC_WUTRL_bit.WUT1
#define RTC_WUTRL_WUT2           RTC_WUTRL_bit.WUT2
#define RTC_WUTRL_WUT3           RTC_WUTRL_bit.WUT3
#define RTC_WUTRL_WUT4           RTC_WUTRL_bit.WUT4
#define RTC_WUTRL_WUT5           RTC_WUTRL_bit.WUT5
#define RTC_WUTRL_WUT6           RTC_WUTRL_bit.WUT6
#define RTC_WUTRL_WUT7           RTC_WUTRL_bit.WUT7

#define RTC_ALRMAR1_ALSU         RTC_ALRMAR1_bit.ALSU
#define RTC_ALRMAR1_ALST         RTC_ALRMAR1_bit.ALST
#define RTC_ALRMAR1_MSK1         RTC_ALRMAR1_bit.MSK1

